# -*- coding: utf-8 -*-
"""
Created on Mon Sep 20 11:02:22 2021

@author: 李立宗  lilizong@gmail.com
微信公众号：计算机视觉之光（微信号cvlight）
计算机视觉核心案例实战——从入门到深度学习（python+OpenCV）
李立宗 著     电子工业出版社
"""

# 诉求：计算边长为3的正方形的面积


# 构造函数area1，无参数、无返回值
def area1():
    print("1:无参数、无返回值：")
    print("边长为3的正方形面积：",3*3)
# 构造函数area2，无参数、有返回值
def area2():
    print("2:无参数、有返回值：")
    return 3*3   #返回值
# 构造函数area3，有参数、无返回值
def area3(r):
    print("3:有参数、无返回值：")
    print("边长为",r,"的正方形面积为:",r*r)
# 构造函数area4,有参数，有返回值
def area4(r):
    print("4:有参数，有返回值：")
    return  r*r
# 调用函数
area1()
print("边长为3的正方形面积为：",area2())
area3(3)
print("边长为3的正方形面积为:",area4(3))
# 不用函数直接计算
area=3*3
print("5:直接计算边长3的长方形面积：",area)








# =====================================================





# 总结：
# =========返回值总结==========
# 如果没有返回值，直接调用函数，执行函数
# 如果有返回值，函数的运行结果，作为一个值来使用
# ========参数总结========
# 无参数，函数的功能是固定的，比如，计算半径为10的面积，只能完成该运算
# 有参数，函数的功能更加灵活，比如，它能够计算不同半径的圆面积


# def area1():
#     print(3.14*10*10)

# def area2(r):
#     print(3.14*r*r)

# def area3():
#     return 3.14*10*10

# def area4(r):
#     return 3.14*r*r

# area1()
# area2(10)
# print(area3())
# print(area4(10))